In [4]:
import numpy as np
import pandas as pd

In [5]:
print(np.__version__)
print(pd.__version__)

1.18.5
1.0.5

In [6]:
x = np.arange(5)

In [9]:
y = np.arange(5)

In [11]:
z = np.add(x,y)

In [12]:
z

array([0, 2, 4, 6, 8])

In [14]:
x1 = ('a','b','c','d','e')

In [18]:
x2 = [1,3,4,5,8]

In [19]:
x3 = {1:'sd',2:'tr',3:'hg',4:'kl',5:'mn'}

In [21]:
x4 = pd.Series(x1,x2)

In [22]:
x4

1    a
3    b
4    c
5    d
8    e
dtype: object

In [23]:
x4 = pd.Series(data = x1)

In [24]:
x4

0    a
1    b
2    c
3    d
4    e
dtype: object

In [28]:
x4 = pd.Series(data = x2, index = ('a','b','c','d','e'))

In [29]:
x4

a    1
b    3
c    4
d    5
e    8
dtype: int64

In [35]:
A = ['Vishal','Rahul','Sahil','Rachit','Pramod']
B = ['Soft','Civil','Advocate','Broker','Police']
C = [1,2,3,6,8]
D = [12,34,56,78]
E = [6,7,8,9]

In [38]:
df = pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['Name','Working','Id','Pay','Tax'])

In [39]:
df

     Name Working        Id     Pay     Tax
a  Vishal   Rahul     Sahil  Rachit  Pramod
b    Soft   Civil  Advocate  Broker  Police
c       1       2         3       6       8
d      12      34        56      78    None
e       6       7         8       9    None

In [41]:
df.drop('Tax',axis = 1)

     Name Working        Id     Pay
a  Vishal   Rahul     Sahil  Rachit
b    Soft   Civil  Advocate  Broker
c       1       2         3       6
d      12      34        56      78
e       6       7         8       9

In [42]:
df

     Name Working        Id     Pay     Tax
a  Vishal   Rahul     Sahil  Rachit  Pramod
b    Soft   Civil  Advocate  Broker  Police
c       1       2         3       6       8
d      12      34        56      78    None
e       6       7         8       9    None

In [43]:
df.drop('e',axis=0,inplace=True)

In [44]:
df

     Name Working        Id     Pay     Tax
a  Vishal   Rahul     Sahil  Rachit  Pramod
b    Soft   Civil  Advocate  Broker  Police
c       1       2         3       6       8
d      12      34        56      78    None

In [45]:
df

     Name Working        Id     Pay     Tax
a  Vishal   Rahul     Sahil  Rachit  Pramod
b    Soft   Civil  Advocate  Broker  Police
c       1       2         3       6       8
d      12      34        56      78    None

In [46]:
data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Height': [5.1, 6.2, 5.1, 5.2], 
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

In [49]:
df1 = pd.DataFrame(data)

In [50]:
df1

     Name  Height Qualification
0     Jai     5.1           Msc
1  Princi     6.2            MA
2  Gaurav     5.1           Msc
3    Anuj     5.2           Msc

In [51]:
address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

In [53]:
df1['Address'] = address

#

In [54]:
df1

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [55]:
df1['Name']

0       Jai
1    Princi
2    Gaurav
3      Anuj
Name: Name, dtype: object

In [66]:
df1.loc[1,'Height']

6.2

In [67]:
x1 = [2,3,4,5,9,8]
y1 = [9,3,8,4,1,2]
z1 = [7,1,4,0,8,6]
v1 = [5,1,8,9,4,2]

In [71]:
df2 = pd.DataFrame([x1,y1,z1,v1],['a','b','c','d'],['X','Y','Z','V','W','U']) #,'e','f',,,,,'W','U'

In [72]:
df2

   X  Y  Z  V  W  U
a  2  3  4  5  9  8
b  9  3  8  4  1  2
c  7  1  4  0  8  6
d  5  1  8  9  4  2

In [85]:
df2[df2['W'] > 4][['W','U','Y','Z','X']] #df2[df2 > 4] df2 > 4

   W  U  Y  Z  X
a  9  8  3  4  2
c  8  6  1  4  7

In [88]:
df2[(df2['W'] > 3) & (df2['U'] > 1)]

   X  Y  Z  V  W  U
a  2  3  4  5  9  8
c  7  1  4  0  8  6
d  5  1  8  9  4  2

In [89]:
d = {'a':[1,2,4,5,6,7],'b':[2,4,5,6,7,np.nan],'c':[2,6,8,9,np.nan,np.nan],'d':[9,2,5,np.nan,np.nan,np.nan]}

In [90]:
df = pd.DataFrame(d)

In [91]:
df

   a    b    c    d
0  1  2.0  2.0  9.0
1  2  4.0  6.0  2.0
2  4  5.0  8.0  5.0
3  5  6.0  9.0  NaN
4  6  7.0  NaN  NaN
5  7  NaN  NaN  NaN

In [94]:
df.dropna(thresh = 2) #use axis =0, thresh = 2(any value )

   a    b    c    d
0  1  2.0  2.0  9.0
1  2  4.0  6.0  2.0
2  4  5.0  8.0  5.0
3  5  6.0  9.0  NaN
4  6  7.0  NaN  NaN

In [95]:
df.fillna(1)

   a    b    c    d
0  1  2.0  2.0  9.0
1  2  4.0  6.0  2.0
2  4  5.0  8.0  5.0
3  5  6.0  9.0  1.0
4  6  7.0  1.0  1.0
5  7  1.0  1.0  1.0

In [105]:
df['d'].fillna(value = df['d'].mean(),axis=0)  #df['b'].fillna(value = 1)

0    9.000000
1    2.000000
2    5.000000
3    5.333333
4    5.333333
5    5.333333
Name: d, dtype: float64

In [8]:
p = {'item':["orange","orange","gun","gun","mango","mango"],'days':["mon","tues","wed","thurs","fri","sat"],'sales':[100,80,5,200,100,5]}

In [9]:
p

{'item': ['orange', 'orange', 'gun', 'gun', 'mango', 'mango'],
 'days': ['mon', 'tues', 'wed', 'thurs', 'fri', 'sat'],
 'sales': [100, 80, 5, 200, 100, 5]}

In [10]:
df = pd.DataFrame(p)

In [11]:
df

     item   days  sales
0  orange    mon    100
1  orange   tues     80
2     gun    wed      5
3     gun  thurs    200
4   mango    fri    100
5   mango    sat      5

In [12]:
x = df.groupby('item')

In [13]:
x.mean()

        sales
item
gun     102.5
mango    52.5
orange   90.0

In [14]:
x.median()

        sales
item
gun     102.5
mango    52.5
orange   90.0

In [15]:
x.max()

        days  sales
item
gun      wed    200
mango    sat    100
orange  tues    100

In [16]:
x.sum()

        sales
item
gun       205
mango     105
orange    180

In [17]:
x.std()

             sales
item
gun     137.885822
mango    67.175144
orange   14.142136

In [18]:
x.count()

        days  sales
item
gun        2      2
mango      2      2
orange     2      2

In [19]:
x.describe()

       sales
       count   mean         std   min    25%    50%     75%    max
item
gun      2.0  102.5  137.885822   5.0  53.75  102.5  151.25  200.0
mango    2.0   52.5   67.175144   5.0  28.75   52.5   76.25  100.0
orange   2.0   90.0   14.142136  80.0  85.00   90.0   95.00  100.0

In [20]:
x.describe().transpose()

item                gun       mango      orange
sales count    2.000000    2.000000    2.000000
      mean   102.500000   52.500000   90.000000
      std    137.885822   67.175144   14.142136
      min      5.000000    5.000000   80.000000
      25%     53.750000   28.750000   85.000000
      50%    102.500000   52.500000   90.000000
      75%    151.250000   76.250000   95.000000
      max    200.000000  100.000000  100.000000

In [21]:
x1 = {'a':[11,12,13,14],'b':[21,22,23,24]}
y1 = {'c':[31,32,33,34],'d':[41,42,43,44]}

In [41]:
x = pd.DataFrame(x1, index = ['p1','p2','p3','p4'])
y = pd.DataFrame(y1, index = ['p1','p2','p6','p7'])

In [42]:
x

     a   b
p1  11  21
p2  12  22
p3  13  23
p4  14  24

In [43]:
y

     c   d
p1  31  41
p2  32  42
p6  33  43
p7  34  44

In [49]:
x.join(y)

     a   b     c     d
p1  11  21  31.0  41.0
p2  12  22  32.0  42.0
p3  13  23   NaN   NaN
p4  14  24   NaN   NaN

In [51]:
x2 = {'a':[1,2,3,7,8,9],'b':[4,5,6,0,1,2],'c':[3,4,5,6,9,8],'d':[7,6,5,4,1,2]}
y2 = {'e':[2,1,4,5,3,6],'f':[4,0,8,6,2,5],'g':[0,2,6,1,4,9],'h':[6,4,2,8,0,1]}
z2 = {'i':[3,4,5,6,1,2],'j':[6,1,4,9,3,7],'k':[1,4,5,3,6,2],'l':[0,8,6,2,5,9]}

In [82]:
df1 = pd.DataFrame(x2 , index = [1,2,3,4,5,6])
df2 = pd.DataFrame(y2, index = [1,2,3,4,5,6])
df3 = pd.DataFrame(z2, index = [4,5,6,7,8,9])

In [83]:
pd.concat([df2,df3])

     e    f    g    h    i    j    k    l
1  2.0  4.0  0.0  6.0  NaN  NaN  NaN  NaN
2  1.0  0.0  2.0  4.0  NaN  NaN  NaN  NaN
3  4.0  8.0  6.0  2.0  NaN  NaN  NaN  NaN
4  5.0  6.0  1.0  8.0  NaN  NaN  NaN  NaN
5  3.0  2.0  4.0  0.0  NaN  NaN  NaN  NaN
6  6.0  5.0  9.0  1.0  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  3.0  6.0  1.0  0.0
5  NaN  NaN  NaN  NaN  4.0  1.0  4.0  8.0
6  NaN  NaN  NaN  NaN  5.0  4.0  5.0  6.0
7  NaN  NaN  NaN  NaN  6.0  9.0  3.0  2.0
8  NaN  NaN  NaN  NaN  1.0  3.0  6.0  5.0
9  NaN  NaN  NaN  NaN  2.0  7.0  2.0  9.0

In [87]:
pd.concat([df1,df3],axis = 1)

     a    b    c    d    i    j    k    l
1  1.0  4.0  3.0  7.0  NaN  NaN  NaN  NaN
2  2.0  5.0  4.0  6.0  NaN  NaN  NaN  NaN
3  3.0  6.0  5.0  5.0  NaN  NaN  NaN  NaN
4  7.0  0.0  6.0  4.0  3.0  6.0  1.0  0.0
5  8.0  1.0  9.0  1.0  4.0  1.0  4.0  8.0
6  9.0  2.0  8.0  2.0  5.0  4.0  5.0  6.0
7  NaN  NaN  NaN  NaN  6.0  9.0  3.0  2.0
8  NaN  NaN  NaN  NaN  1.0  3.0  6.0  5.0
9  NaN  NaN  NaN  NaN  2.0  7.0  2.0  9.0

In [101]:
m = {'a':[1,2,3,7,8,9],'b':[4,5,6,0,1,2],'c':[3,4,5,6,9,8],'d':[7,6,5,4,1,2]}
n = {'a':[2,1,4,5,3,6],'f':[4,0,8,6,2,5],'g':[0,2,6,1,4,9],'h':[6,4,2,8,0,1]}

In [102]:
df5 = pd.DataFrame(m)
df6 = pd.DataFrame(n)

In [103]:
df5

   a  b  c  d
0  1  4  3  7
1  2  5  4  6
2  3  6  5  5
3  7  0  6  4
4  8  1  9  1
5  9  2  8  2

In [104]:
df6

   a  f  g  h
0  2  4  0  6
1  1  0  2  4
2  4  8  6  2
3  5  6  1  8
4  3  2  4  0
5  6  5  9  1

In [105]:
pd.merge(df5,df6 , how = 'right', on = 'a')

   a    b    c    d  f  g  h
0  1  4.0  3.0  7.0  0  2  4
1  2  5.0  4.0  6.0  4  0  6
2  3  6.0  5.0  5.0  2  4  0
3  4  NaN  NaN  NaN  8  6  2
4  5  NaN  NaN  NaN  6  1  8
5  6  NaN  NaN  NaN  5  9  1

In [107]:
def inc(df5):
    df5 = df5 + 100
    return df5

In [108]:
df5['b'].apply(inc)

0    104
1    105
2    106
3    100
4    101
5    102
Name: b, dtype: int64

In [110]:
df5['b'].unique()  #  unique(), nunique(), value_counts(),isnull()

array([4, 5, 6, 0, 1, 2], dtype=int64)

In [111]:
df5.isnull()

       a      b      c      d
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [112]:
pwd

'C:\\Users\\vishwash'

In [113]:
#pd.read_csv('file name')   pd = pandas.read_filetype('filename')   ..... html5lib for html file ,, lxml for csv ,, sqlo